[
  {
    "id": "master-the-paths",
    "name": "Master the Paths",
    "affray": "CUT OFF THE HEAD",
    "affray_rules": "<br><i>Fall upon the leaders of the foe without warning.</i><br>You complete this battle tactic at the end of your turn if an enemy <span class=\"kwb\">HERO</span> has been destroyed this battle.",
    "strike": "SEIZE THE PATHS",
    "strike_rules": "<br><i>Open tunnels through the foliage are a vital boon. Force the enemy from them.</i><br>You complete this battle tactic at the end of your turn if there are more friendly units in neutral territory than enemy units.<br><br>If there is no neutral territory in the <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Battleplans\">battleplan</a> you are playing, you complete this tactic at the end of your turn if there are no enemy units within friendly territory.",
    "domination": "ENVELOP AND STRANGLE",
    "domination_rules": "<br><i>Ensure no corner of the Neosian undergrowth is beyond your reach.</i><br>You complete this battle tactic at the end of your turn if at least 3 different friendly units are each wholly within 9\" of a different corner of the battlefield and only 1 of those corners is wholly within friendly territory. No more than 1 of those units can have been set up this turn."
  },
  {
    "id": "restless-energy",
    "name": "Restless Energy",
    "affray": "WATER WITH BLOOD",
    "affray_rules": "<br><i>Sometimes, red must help the green to flourish.</i><br>\n\t\tYou complete this battle tactic at the end of your turn if you control an <span class=\"tooltip00027\" data-tooltip-content=\"#tooltip_content00027\"><span class=\"tt kwbu\">objective</span></span> that was controlled by your opponent at the start of your turn.",
    "strike": "INVASIVE SPECIES",
    "strike_rules": "<br><i>Reach your vines and tendrils deep into the territory of the opposition.</i><br>You complete this battle tactic at the end of your turn if you <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-Control\">control</a> every <span class=\"tooltip00027\" data-tooltip-content=\"#tooltip_content00027\"><span class=\"tt kwbu\">objective</span></span> within enemy territory. If there are no objectives within enemy territory, you complete this battle tactic at the end of your turn if you control every objective that was controlled by your opponent at the start of your turn.",
    "domination": "ALL ROOTS ENTWINED",
    "domination_rules": "<br><i>The cycle will only achieve its true potential when it is brought under your rule.</i><br>You complete this battle tactic at the end of your turn if you control every objective that can be controlled"
  },
  {
    "id": "intercept-and-recover",
    "name": "Intercept and Recover",
    "affray": "STOLEN SEEDPOD",
    "affray_rules": "<br><i>Plucked from the branches of one of the towering trees of Neos, this seed contains a core of raw potential.</i><br>You complete this battle tactic at the end of your turn if at least 1 enemy unit carrying a Ghyranite Treasure has been destroyed this battle.",
    "strike": "CONTRABAND AQUA GHYRANIS",
    "strike_rules": "<br><i>The Oakenbrow zealously guard Neos's many springs of Aqua Ghyranis, but their gaze cannot be everywhere ...</i><br>You complete this battle tactic at the end of your turn if at least 2 enemy units carrying a Ghyranite Treasure have been destroyed this battle.",
    "domination": "LEY LINE TAPROOT",
    "domination_rules": "<br><i>Pulsing with the power of the ley lines, this root glows with the power to work wonders - or horrors.</i><br>You complete this battle tactic at the end of your turn if at least 3 enemy units carrying a Ghyranite Treasure have been destroyed this battle."
  },
  {
    "id": "wrathful-cycles",
    "name": "Wrathful Cycles",
    "affray": "DEFIANT SURGE",
    "affray_rules": "<br><i>Use the invigoration that floods you to overwhelm the enemy.</i><br>You complete this battle tactic at the end of your turn if you <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-Control\">control</a> more <span class=\"tooltip00027\" data-tooltip-content=\"#tooltip_content00027\"><span class=\"tt kwbu\">objectives</span></span> than your opponent.",
    "strike": "DARING RESURGENCE",
    "strike_rules": "<br><i>Life always fights to endure. Draw upon that vitality now.</i><br>You complete this battle tactic at the end of your turn if you are the <span class=\"tooltip00033\" data-tooltip-content=\"#tooltip_content00033\"><span class=\"tt kwbu\">underdog</span></span> this battle round, there is at least 1 friendly unit on the battlefield and at least half of the friendly units on the battlefield (rounding up) used a <span class=\"tooltip00044\" data-tooltip-content=\"#tooltip_content00044\"><span class=\"tt kwbu\"><span class=\"kwb\">FIGHT</span></span> <span class=\"tt kwbu\">ability</span></span> this turn.",
    "domination": "MASTER OF STRATEGY",
    "domination_rules": "<br><i>Victory blooms from victory, growing greater by the moment.</i><br>You complete this battle tactic at the end of your turn if there is a different friendly unit wholly within each large quarter of the battlefield, you control more objectives than your opponent, and there are no enemy units contesting any objectives that you control."
  },
  {
    "id": "scouting-force",
    "name": "Scouting Force",
    "affray": "RAIDING PARTY",
    "affray_rules": "<br><i>Ensure the foe knows you will brave their domains.</i><br>You complete this battle tactic at the end of your turn if there are 3 or more friendly scout units wholly outside friendly territory.",
    "strike": "BOLD EXPLORERS",
    "strike_rules": "<br><i>Only the brave will plunge deep into the ever-seething heart of Neos.</i><br>You complete this battle tactic at the end of your turn if 3 or more <span class=\"tooltip00027\" data-tooltip-content=\"#tooltip_content00027\"><span class=\"tt kwbu\">objectives</span></span> or or non-<span class=\"tooltip00023\" data-tooltip-content=\"#tooltip_content00023\"><span class=\"tt kwbu\"><span class=\"kwb\">FACTION</span></span> <span class=\"tt kwbu\"><span class=\"kwb\">TERRAIN</span></span></span> <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-2025-26\">terrain features</a> that you <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-Control\">control</a>, in any combination, are being <span class=\"tooltip00028\" data-tooltip-content=\"#tooltip_content00028\"><span class=\"tt kwbu\">contest</span></span>ed by any friendly scout units. Those objectives and terrain features must be within enemy territory.",
    "domination": "COURAGEOUS ADVENTURERS",
    "domination_rules": "<br><i>The depths of the forest hold many secrets. Make sure they are yours.</i><br>You complete this battle tactic at the end of your turn if a friendly scout unit that was not <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Setting-Up-Units\">set up</a> this turn is <span class=\"tooltip00028\" data-tooltip-content=\"#tooltip_content00028\"><span class=\"tt kwbu\">contesting</span></span> a non-<span class=\"tooltip00023\" data-tooltip-content=\"#tooltip_content00023\"><span class=\"tt kwbu\"><span class=\"kwb\">FACTION</span></span> <span class=\"tt kwbu\"><span class=\"kwb\">TERRAIN</span></span></span> <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-2025-26\">terrain feature</a> that you <a href=\"https://wahapedia.ru/aos4/the-rules/the-core-rules/#Terrain-Control\">control</a>, that is wholly within enemy territory, and that is more than 6\" from friendly territory."
  },
  {
    "id": "attuned-to-ghyran",
    "name": "Attuned to Ghyran",
    "affray": "SACRED CENTRALITY",
    "affray_rules": "<br><i>Assemble at the heart of the field, as the druids once did around their holy henges.</i><br>You complete this battle tactic at the end of your turn if there are at least 2 friendly units within 3\" of the centre of the battlefield that are not <span class=\"tooltip00011\" data-tooltip-content=\"#tooltip_content00011\"><span class=\"tt kwbu\">in</span> <span class=\"tt kwbu\">combat</span></span>.",
    "strike": "FEY STRIKES",
    "strike_rules": "<br><i>Slip in and out of the melee like the cackling spites of the deep woods.</i><br>You complete this battle tactic at the end of your turn if all the following are true:<br><ul><li>At least 2 friendly units moved as part of a <span class=\"kwb\">RETREAT</span> ability this turn. Those units are <b>lure</b> units.</li><li>At least 2 other friendly units <span class=\"tooltip00034\" data-tooltip-content=\"#tooltip_content00034\"><span class=\"tt kwbu\">charged</span></span> this turn and at least 1 of those units ended the charge move <span class=\"tooltip00011\" data-tooltip-content=\"#tooltip_content00011\"><span class=\"tt kwbu\">in</span> <span class=\"tt kwbu\">combat</span></span> with an enemy unit from which any <b>lure</b> units retreated.</li></ul>",
    "domination": "PURIFICATION RITES",
    "domination_rules": "<br><i>New birth sometimes demands a matching price in death ...</i><br>You complete this battle tactic at the end of your turn if there are no enemy units within friendly territory and no enemy units within neutral territory."
  }
]